ensurancePharmacy/jmeter-tests/results/google-html-report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1544,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 264.69624352331596,
    "medianResTime" : 222.0,
    "minResTime" : 57.0,
    "maxResTime" : 1163.0,
    "pct1ResTime" : 488.0,
    "pct2ResTime" : 581.75,
    "pct3ResTime" : 765.0999999999999,
    "throughput" : 58.18510702441965,
    "receivedKBytesPerSec" : 675.7782690849224,
    "sentKBytesPerSec" : 18.68098997588182
  },
  "GET - Google Homepage-2" : {
    "transaction" : "GET - Google Homepage-2",
    "sampleCount" : 348,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 249.8160919540231,
    "medianResTime" : 229.5,
    "minResTime" : 205.0,
    "maxResTime" : 937.0,
    "pct1ResTime" : 262.4000000000001,
    "pct2ResTime" : 378.0,
    "pct3ResTime" : 850.1899999999985,
    "throughput" : 23.127533727653354,
    "receivedKBytesPerSec" : 445.9114695828072,
    "sentKBytesPerSec" : 7.3628671828271415
  },
  "GET - Google Homepage-1" : {
    "transaction" : "GET - Google Homepage-1",
    "sampleCount" : 348,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 76.28448275862065,
    "medianResTime" : 69.0,
    "minResTime" : 57.0,
    "maxResTime" : 340.0,
    "pct1ResTime" : 87.10000000000002,
    "pct2ResTime" : 97.10000000000002,
    "pct3ResTime" : 272.0799999999999,
    "throughput" : 23.380811609782317,
    "receivedKBytesPerSec" : 23.152483371405534,
    "sentKBytesPerSec" : 5.982199845471647
  },
  "GET - Google Homepage" : {
    "transaction" : "GET - Google Homepage",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 454.068,
    "medianResTime" : 463.0,
    "minResTime" : 196.0,
    "maxResTime" : 1163.0,
    "pct1ResTime" : 613.9000000000001,
    "pct2ResTime" : 690.6999999999999,
    "pct3ResTime" : 1002.2600000000007,
    "throughput" : 18.842327404280976,
    "receivedKBytesPerSec" : 388.94288066211936,
    "sentKBytesPerSec" : 9.664936312933373
  },
  "GET - Google Homepage-0" : {
    "transaction" : "GET - Google Homepage-0",
    "sampleCount" : 348,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 195.90229885057468,
    "medianResTime" : 171.0,
    "minResTime" : 154.0,
    "maxResTime" : 496.0,
    "pct1ResTime" : 294.0,
    "pct2ResTime" : 333.75000000000006,
    "pct3ResTime" : 396.0,
    "throughput" : 23.139836425294234,
    "receivedKBytesPerSec" : 37.05249164671853,
    "sentKBytesPerSec" : 2.6213095950528627
  }
}